УТ_для_edt.РасширениеСмарт/src/Documents/МаркетинговыеМероприятияДокумент/МаркетинговыеМероприятияДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>МаркетинговыеМероприятияДокумент</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>НаименованиеМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПользовательПоставилОценку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ТипМероприятия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяНачалаПлан</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>КлиентПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПроведенияОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ИсполнительДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяПроведенияДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗаявкаЗакрыта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияЗаявки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаНачалаФакт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Оценка</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДатаОценки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ed5953c0-f430-489a-959a-1c9b18a43b94">
    <name>КомуПередано</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="7fa85e95-3db1-4305-a9b3-eff06a2fa2c7">
    <name>КомментарийИнженера</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec30e53b-638b-4a49-83b6-d35b7b34d6ab">
    <name>ЖелаемаяДатаИзготовления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="042868a1-e1b7-4bf7-a543-11f52a366a04">
    <name>Срочно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e082edc2-87c6-4a03-bd26-abd073e52e25">
    <name>ДатаНачалаРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a0c18547-e9eb-4899-916a-5b2e886b3611">
    <name>смартДатаНачала</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="591d17b1-6b51-434c-b04d-0093a434b66e">
    <name>смартДатаОкончания</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79791d53-7f2d-47a5-b15e-2d4440382239">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7d5fd00-7cc7-458b-aa54-a3662fea2df1">
    <name>смартПровелДемонстрацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f2c32cfa-7b46-4514-bdd2-108a08342f59">
    <name>смартИмеетПолиграфическоеОборудование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>табПредставительКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>КонтактныеЛица</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="03d6da93-802e-4435-8914-be9c96eccc09">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табМатериалыДляДемонстрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Материалы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>табОборудованиеДляДемонстрации</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Оборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="17912b24-a32a-4739-8f43-0640817b2712">
    <name>ИсполнителиДемоЗал</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="6383e9aa-3573-4cd3-a1b9-c6aaa13839b5">
      <name>Исполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b6f03615-5dad-4109-bba8-95ff63f8ee9b">
      <name>ЗатраченноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="7c4a180a-c7ab-41c7-87d5-e56c178c4e3b">
      <name>СверхурочноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="99ada54f-5520-400b-baea-b5e9eec6aade">
      <name>смартКомментарийИнженера</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="ef823346-0d77-4fa8-aec6-a4089b82b441">
    <name>ВидыРабот</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="860bd59b-2a0d-4e31-9ff1-f76c19d90e5c">
      <name>ВидРаботы</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>150</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="4e93c4d2-6461-4800-9185-1ccaf477b170">
      <name>смартЗатраченноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="a78bebfb-6d7b-435e-b9cf-a6a1ae596721">
      <name>смартСверхурочноеВремя</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c3acc578-0cd3-4ba3-8977-29f9d585aea7">
      <name>смартИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e1f58398-3b23-4795-98fb-e0ab4701d5d2">
    <name>ОборудованиеДляДемонстрацииИнженер</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="59dcf85e-556e-4954-8b8b-f88d427f2fd2">
      <name>Оборудование</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="8b412641-a641-49cb-80be-6643fba5619b">
      <name>смартИсполнитель</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt.РасширениеСмарт/src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>Пользователи</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84450f4c-12f4-48e1-92d7-52e1fec0d1f1">
    <name>смартМенеджерСайта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58a4348b-43e7-46fb-966f-fdf2e9858abd">
    <name>смартРабочаяПочта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9984e2d4-a5d7-4891-bd52-251aae7eea37">
    <name>смартРабочийТелефон</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/Documents/МаркетинговыеМероприятияДокумент/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ДоработкиСмарт

&Вместо("ПриКопировании")
Процедура ПриКопировании(ОбъектКопирования)
	
	ТекОбъект = ЭтотОбъект;
	
	ТекОбъект.ДатаНачалаПлан		= Дата(1,1,1,0,0,0);
	ТекОбъект.ВремяНачалаПлан		= Дата(1,1,1,0,0,0);
	ТекОбъект.ЗаявкаЗакрыта			= Ложь;
	ТекОбъект.ДатаЗакрытияЗаявки 	= Дата(1,1,1,0,0,0);
	ТекОбъект.ДатаНачалаФакт 		= Дата(1,1,1,0,0,0);
	ТекОбъект.ВремяПроведенияОт 	= Дата(1,1,1,0,0,0);
	ТекОбъект.ВремяПроведенияДо 	= Дата(1,1,1,0,0,0);
	ТекОбъект.ИсполнительДемоЗал 	= Справочники.Пользователи.ПустаяСсылка();
	ТекОбъект.Оценка 				= 0;
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	ТекОбъект.смартДатаНачала 		= Дата(1, 1, 1); 
	ТекОбъект.смартДатаОкончания 	= Дата(1, 1, 1); 
	ТекОбъект.Статус 				= Неопределено;
	ТекОбъект.Комментарий 			= "";
	ТекОбъект.КомментарийИнженера 	= "";
	ТекОбъект.КомуПередано 			= "";
	ТекОбъект.ДатаОценки			= Дата(1, 1, 1);
	ТекОбъект.ПользовательПоставилОценку = Неопределено;
	ТекОбъект.ИсполнителиДемоЗал.Очистить();
	ТекОбъект.ВидыРабот.Очистить();
	ТекОбъект.ОборудованиеДляДемонстрацииИнженер.Очистить();
	ТекОбъект.ИсторияИзмененияОценки.Очистить();
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
КонецПроцедуры

&Вместо("ОбработкаЗаполнения")
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	//++ #4898 смарт: Тимофеева 17.11.2025 / Создание механизма для учета квалификаций инженеров и менеджеров. 	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.смартОбучениеСотрудников") Тогда 	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	смартОбучениеСотрудников.Ссылка КАК ДокументОснование,
		|	смартОбучениеСотрудников.ДатаНачала КАК смартДатаНачала,
		|	смартОбучениеСотрудников.ДатаОкончания КАК смартДатаОкончания,
		|	смартОбучениеСотрудников.Партнер КАК КлиентПартнер,
		|	&ТипМероприятия КАК ТипМероприятия,
		|	ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Новая) КАК Статус,
		|	смартОбучениеСотрудников.МестоПроведения КАК ДемоЗал,
		|	смартОбучениеСотрудников.ОписаниеПрограммы КАК ОписаниеПрограммы
		|ИЗ
		|	Документ.смартОбучениеСотрудников КАК смартОбучениеСотрудников
		|ГДЕ
		|	смартОбучениеСотрудников.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартОбучениеСотрудниковБронируемоеОборудование.Оборудование КАК Оборудование
		|ИЗ
		|	Документ.смартОбучениеСотрудников.БронируемоеОборудование КАК смартОбучениеСотрудниковБронируемоеОборудование
		|ГДЕ
		|	смартОбучениеСотрудниковБронируемоеОборудование.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартОбучениеСотрудниковПредставителиКлиента.КонтактноеЛицо КАК КонтактныеЛица,
		|	смартОбучениеСотрудниковПредставителиКлиента.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.смартОбучениеСотрудников.ПредставителиКлиента КАК смартОбучениеСотрудниковПредставителиКлиента
		|ГДЕ
		|	смартОбучениеСотрудниковПредставителиКлиента.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартОбучениеСотрудниковСотрудники.Сотрудник КАК Сотрудник
		|ИЗ
		|	Документ.смартОбучениеСотрудников.Сотрудники КАК смартОбучениеСотрудниковСотрудники
		|ГДЕ
		|	смартОбучениеСотрудниковСотрудники.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	смартОбучениеСотрудниковПреподаватели.Преподаватель КАК Преподаватель,
		|	ЕСТЬNULL(ФизическиеЛицаПользователей.Ссылка, ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка)) КАК Исполнитель
		|ИЗ
		|	Документ.смартОбучениеСотрудников.Преподаватели КАК смартОбучениеСотрудниковПреподаватели
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛицаПользователей
		|		ПО смартОбучениеСотрудниковПреподаватели.Преподаватель.ФизическоеЛицо = ФизическиеЛицаПользователей.Ссылка
		|ГДЕ
		|	смартОбучениеСотрудниковПреподаватели.Ссылка = &Ссылка"; 
		
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		Запрос.УстановитьПараметр("ТипМероприятия", Справочники.демоТипыМероприятия.НайтиПоНаименованию("(к) Обучение в демозале", Истина));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();		
		
		ЭтотОбъект.табОборудованиеДляДемонстрации.Загрузить(РезультатЗапроса[1].Выгрузить());
		ЭтотОбъект.табПредставительКлиента.Загрузить(РезультатЗапроса[2].Выгрузить());
		
		МассивСотрудников	 = РезультатЗапроса[3].Выгрузить().ВыгрузитьКолонку("Сотрудник");
		МассивПреподавателей = РезультатЗапроса[4].Выгрузить().ВыгрузитьКолонку("Преподаватель");
		ЭтотОбъект.ИсполнителиДемоЗал.Загрузить(РезультатЗапроса[4].Выгрузить());
		//ЭтотОбъект.ИсполнителиДемоЗал.ЗагрузитьКолонку(РезультатЗапроса[4].Выгрузить().ВыгрузитьКолонку("Исполнитель"), "Исполнитель");
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса[0].Выбрать(); 	
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ЗаполнитьЗначениясвойств(ЭтотОбъект, ВыборкаДетальныеЗаписи);
			ЭтотОбъект.Менеджер 	= Пользователи.АвторизованныйПользователь();
			ЭтотОбъект.Комментарий 	= СтрШаблон("Преподаватели:
												|%1
												|
												|
												|%2
												|
												|
												|Сотрудники проходящие обучение:
												|%3",
												СтрСоединить(МассивПреподавателей, Символы.ПС),
												ВыборкаДетальныеЗаписи.ОписаниеПрограммы,
												СтрСоединить(МассивСотрудников, Символы.ПС));
		КонецЕсли;				
		
	КонецЕсли;
	//-- #4898 смарт: Тимофеева 17.11.2025 
	
КонецПроцедуры

#Область ДвижениеПоРегистрам

&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр демоДемонстрацияОборудования Приход
	//Если ЭтотОбъект.ЗаявкаЗакрыта = Истина Тогда
	//	Движения.демоДемонстрацияОборудования.Записывать = Истина;
	//	Для Каждого ТекСтрокатабОборудованиеДляДемонстрации Из табОборудованиеДляДемонстрации Цикл
	//		Движение = Движения.демоДемонстрацияОборудования.Добавить();
	//		//Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период = Дата;
	//		Движение.Партнер = КлиентПартнер;
	//		Движение.Менеджер = Менеджер;
	//		Движение.ОтветственныйЗаДемонстрацию = ИсполнительДемоЗал;
	//		Движение.Номенклатура = ТекСтрокатабОборудованиеДляДемонстрации.Оборудование.Номенклатура;
	//		Движение.КодСтроки = ТекСтрокатабОборудованиеДляДемонстрации.НомерСтроки;
	//		Движение.Распоряжение = Ссылка;
	//		Движение.КоличествоДемонстрация = 1;
	//	КонецЦикла;
	//Иначе
	//	ОбработкаУдаленияПроведения(Ложь);
	//КонецЕсли;
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.Текст="ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	МаркетинговыеМероприятияДокумент.Дата КАК Период,
	             |	МаркетинговыеМероприятияДокумент.КлиентПартнер КАК Партнер,
	             |	МаркетинговыеМероприятияДокумент.Менеджер КАК Менеджер,
	             |	МаркетинговыеМероприятияДокумент.ИсполнительДемоЗал КАК ОтветственныйЗаДемонстрацию,
	             |	МаркетинговыеМероприятияДокумент.Ссылка КАК Распоряжение,
	             |	NULL КАК Номенклатура,
	             |	0 КАК КоличествоДемонстрация,
	             |	МаркетинговыеМероприятияДокумент.ДатаНачалаПлан КАК ДатаНачалаПлан,
	             |	МаркетинговыеМероприятияДокумент.ДатаНачалаФакт КАК ДатаНачалаФакт
	             |ПОМЕСТИТЬ ВТ_Таб
	             |ИЗ
	             |	Документ.МаркетинговыеМероприятияДокумент КАК МаркетинговыеМероприятияДокумент
	             |ГДЕ
	             |	МаркетинговыеМероприятияДокумент.Ссылка = &Ссылка
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	ТабОборудование.Ссылка.Дата,
	             |	ТабОборудование.Ссылка.КлиентПартнер,
	             |	ТабОборудование.Ссылка.Менеджер,
	             |	ТабОборудование.Ссылка.ИсполнительДемоЗал,
	             |	ТабОборудование.Ссылка.Ссылка,
	             |	ТабОборудование.Оборудование,
	             |	1,
	             |	ТабОборудование.Ссылка.ДатаНачалаПлан,
	             |	ТабОборудование.Ссылка.ДатаНачалаФакт
	             |ИЗ
	             |	Документ.МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации КАК ТабОборудование
	             |ГДЕ
	             |	ТабОборудование.Ссылка = &Ссылка
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	Матириалы.Ссылка.Дата,
	             |	Матириалы.Ссылка.КлиентПартнер,
	             |	Матириалы.Ссылка.Менеджер,
	             |	Матириалы.Ссылка.ИсполнительДемоЗал,
	             |	Матириалы.Ссылка.Ссылка,
	             |	Матириалы.Материалы,
	             |	1,
	             |	Матириалы.Ссылка.ДатаНачалаПлан,
	             |	Матириалы.Ссылка.ДатаНачалаФакт
	             |ИЗ
	             |	Документ.МаркетинговыеМероприятияДокумент.табМатериалыДляДемонстрации КАК Матириалы
	             |ГДЕ
	             |	Матириалы.Ссылка = &Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	СУММА(ВТ_Таб.КоличествоДемонстрация) КАК Кол
	             |ПОМЕСТИТЬ ВТ_Кол
	             |ИЗ
	             |	ВТ_Таб КАК ВТ_Таб
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_Таб.Период КАК Период,
	             |	ВТ_Таб.Партнер КАК Партнер,
	             |	ВТ_Таб.Менеджер КАК Менеджер,
	             |	ВТ_Таб.ОтветственныйЗаДемонстрацию КАК ОтветственныйЗаДемонстрацию,
	             |	ВТ_Таб.Распоряжение КАК Распоряжение,
	             |	ВТ_Таб.Номенклатура КАК Номенклатура,
	             |	ВТ_Таб.КоличествоДемонстрация КАК КоличествоДемонстрация,
	             |	ВТ_Таб.ДатаНачалаПлан КАК ДатаНачалаПлан,
	             |	ВТ_Таб.ДатаНачалаФакт КАК ДатаНачалаФакт
	             |ИЗ
	             |	ВТ_Таб КАК ВТ_Таб,
	             |	ВТ_Кол КАК ВТ_Кол
	             |ГДЕ
	             |	(ВТ_Кол.Кол = 0
	             |			ИЛИ НЕ ВТ_Таб.Номенклатура ЕСТЬ NULL)";
	НаборДвиженией=Движения.демоДемонстрацияОборудования;
	НаборДвиженией.Записывать=Истина;
	НаборДвиженией.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&Вместо("ОбработкаУдаленияПроведения")
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	НаборЗаписей = РегистрыНакопления.демоДемонстрацияОборудования.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
	
КонецПроцедуры

&Вместо("ПередЗаписью")
Процедура смарт_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	// Фролов+
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;	
	
	//++ #Б7900 смарт: Шляпников 24.08.2026 / Документ "Маркетинговое мероприятие". Форма списка документов. Отбор по полиграфическому оборудованию.
	смартИмеетПолиграфическоеОборудование = смартДокументИмеетПолиграфическоеОборудование();
	//-- #Б7900 смарт: Шляпников 24.08.2026
	
	//++ #Б-1982 смарт: Лопато 13.02.2025 //Заявка на маркетинговое мероприятие. Доработка функционала. Этап 1.  
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения 
		И НЕ Пользователи.РолиДоступны("АдминистраторДемоЗала") Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Отмена проведения доступна только администратору демо-зала!", , , , Отказ);
		
	КонецЕсли;	
	
	Если НЕ Отказ 
		И (РежимЗаписи = РежимЗаписиДокумента.Проведение
		   ИЛИ (ЭтотОбъект.Проведен
		   		И НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)) Тогда

		Если ЭтоНовый() 
			 ИЛИ НЕ ЗначениеЗаполнено(Статус) Тогда
			 
			Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Новая;
			
		КонецЕсли;

		//++ #Б-2562 смарт: Лопато 04.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
		ЗаявкаЗакрыта = Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта;

		Если Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта Тогда
			ДатаЗакрытияЗаявки = ТекущаяДатаСеанса();	
		КонецЕсли;	
		//-- #Б-2562 смарт: Лопато 04.03.2025
		
	ИначеЕсли (ЭтотОбъект.Проведен
		   	   	   И РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения)
			  ИЛИ (НЕ ЭтотОбъект.Проведен
			  	 	   И РежимЗаписи = РежимЗаписиДокумента.Запись) Тогда
			  
		Статус = Неопределено;	  
		
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", 		РежимЗаписи);
	ДополнительныеСвойства.Вставить("ПредыдущийСтатус", Ссылка.Статус);
	//-- #Б-1982 смарт: Лопато 13.02.2025
	
	//++ смарт:ММ #011 154 13.12.2019
	ДополнительныеСвойства.Вставить("смартЭтоНовый", ЭтоНовый());
	//-- смарт:ММ 13.12.2019
	
	//++ #Б-1988 смарт: Лопато 21.02.2025 //Заявка на маркетинговое мероприятие. Резерв оборудования. Дополнение. Этап 4.  
	УстановитьПривилегированныйРежим(Истина);

	МассивОписанийДляНапоминаний = Новый Массив;
	
	//++ #Б-1474 смарт: Фролов 05.12.2024 //Доработка функционала Маркетингового мероприятия
	Если НЕ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И НЕ (Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена
			  ИЛИ Статус = Перечисления.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта) Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ссылка КАК Ссылка,
		|	Ссылка.Менеджер КАК Менеджер,
		//++ #Б-2596 смарт: Лопато 10.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
		|	Ссылка.ТипМероприятия КАК ТипМероприятия,
		//-- #Б-2596 смарт: Лопато 10.03.2025
		|	Ссылка.ТипМероприятия.смартРезервироватьОборудование КАК смартРезервироватьОборудование,
		|	Ссылка.смартДатаНачала КАК смартДатаНачала,
		|	Ссылка.смартДатаОкончания КАК смартДатаОкончания,
		|	Оборудование КАК Оборудование
		|ИЗ
		|	Документ.МаркетинговыеМероприятияДокумент.табОборудованиеДляДемонстрации
		|ГДЕ
		|	Оборудование В(&МассивОборудоваания)
		|	И НЕ Ссылка.ПометкаУдаления
		|	И 1 = 1
		|	И Ссылка.Проведен
		|	И НЕ Ссылка.Статус В (ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Закрыта),
		|		  				  ЗНАЧЕНИЕ(Перечисление.смартСтатусыЗаявокНаМаркетинговоеМероприятие.Отмена))
		|	И ВЫБОР
		|		КОГДА 
		|			ВЫБОР 
		|				КОГДА 
		|					Ссылка.смартДатаНачала = &ДатаНачала И Ссылка.смартДатаОкончания = &ДатаОкончания
		|				ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			ИЛИ 
		|			ВЫБОР 
		|				КОГДА 
		|					Ссылка.смартДатаНачала < &ДатаНачала И &ДатаНачала < Ссылка.смартДатаОкончания
		|				ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			ИЛИ 
		|			ВЫБОР
		|				КОГДА Ссылка.смартДатаНачала < &ДатаОкончания И &ДатаОкончания < Ссылка.смартДатаОкончания
		|				ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			ИЛИ ВЫБОР
		|				КОГДА &ДатаНачала < Ссылка.смартДатаНачала И Ссылка.смартДатаНачала < &ДатаОкончания
		|				ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|			ИЛИ ВЫБОР
		|				КОГДА &ДатаНачала < Ссылка.смартДатаОкончания И Ссылка.смартДатаОкончания < &ДатаОкончания
		|				ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ
		|		ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ
		//++ #Б-1780 смарт: Фролов 25.12.2024 //Маркетинговое мероприятие с бронью времени не проводится
		|	И Ссылка <> &Ссылка");
		//-- #Б-1781 смарт: Фролов 25.12.2024
		
		МассивОборудоваания = Новый Массив;
		Для Каждого СтртабОборудованиеДляДемонстрации Из табОборудованиеДляДемонстрации Цикл
			
			МассивОборудоваания.Добавить(СтртабОборудованиеДляДемонстрации.Оборудование);	
			
		КонецЦикла;
		
		Если МассивОборудоваания.Количество() > 0 Тогда
			
			Запрос.УстановитьПараметр("МассивОборудоваания", МассивОборудоваания);
			//++ #Б-1780 смарт: Фролов 25.12.2024 //Маркетинговое мероприятие с бронью времени не проводится
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			//-- #Б-1780 смарт: Фролов 25.12.2024
			
			Если НЕ ЗначениеЗаполнено(смартДатаНачала)
				ИЛИ НЕ ЗначениеЗаполнено(смартДатаОкончания) Тогда
					
				ОбщегоНазначения.СообщитьПользователю("Заполните дату начала и дату окончания мероприятия!", , , , Отказ);
				
				Возврат;
				
			КонецЕсли;

			Запрос.УстановитьПараметр("ДатаНачала",    смартДатаНачала);
			Запрос.УстановитьПараметр("ДатаОкончания", смартДатаОкончания);

			Если ТипМероприятия.смартРезервироватьОборудование Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "1 = 1", "НЕ Ссылка.ТипМероприятия.смартРезервироватьОборудование");
			КонецЕсли;

			//++ #Б-2596 смарт: Лопато 10.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
			МассивТипыМероприятийБезПроверкиПериодов 
				= Справочники.смартПредопределенныеЗначения.Настройки.ТипыМаркетинговыхМероприятийБезПроверкиПересеченийПериодов.ВыгрузитьКолонку("ТипМероприятия");
				
			ЭтоТипМероприятияБезПроверкиПериодов = ЗначениеЗаполнено(ТипМероприятия) 
					  							   И МассивТипыМероприятийБезПроверкиПериодов.Найти(ТипМероприятия) <> Неопределено;
			//-- #Б-2596 смарт: Лопато 10.03.2025
			
			Результат = Запрос.Выполнить();
		
			Если НЕ Результат.Пустой() Тогда
				
				Выборка = Результат.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					//++ #Б-2596 смарт: Лопато 10.03.2025 //Заявка на маркетинговое мероприятие. Дополнения.  
					НаименованиеОборудования = СокрЛП(Выборка.Оборудование);
					СтрокаОборудования = Лев(НаименованиеОборудования, СтрНайти(НаименованиеОборудования, " / ") - 1);
					
					ПредставлениеЗаявки = СокрЛП(Выборка.Ссылка);
					СтрокаЗаявки = Лев(ПредставлениеЗаявки, СтрДлина(ПредставлениеЗаявки) - 9);
					
					СтрокаОшибки = "На оборудование """ + СтрокаОборудования + """" + Символы.ПС 
								   + "создана заявка " + СтрокаЗаявки 
								   + " на период с " + СокрЛП(Выборка.смартДатаНачала) 
								   + " по " + СокрЛП(Выборка.смартДатаОкончания)
								   + " с типом """ + СокрЛП(Выборка.ТипМероприятия) + """";

					Если ЭтоТипМероприятияБезПроверкиПериодов Тогда
						
						ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки);
						
						Продолжить;
						
					КонецЕсли;	
					
					//++ #Б-2732 смарт: Лопато 21.03.2025 //Заявка на маркетинговое мероприятие. Дополнения к 2596.  
					ДокументПересеченияБезПроверкиПериодов = ЗначениеЗаполнено(Выборка.ТипМероприятия) 
							  							     И МассивТипыМероприятийБезПроверкиПериодов.Найти(Выборка.ТипМероприятия) <> Неопределено;
															 
					Если ДокументПересеченияБезПроверкиПериодов Тогда
						
						ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки);
						
						Продолжить;
						
					КонецЕсли;	
					//-- #Б-2732 смарт: Лопато 21.03.2025
					
					Если НЕ ТипМероприятия.смартРезервироватьОборудование Тогда
						
						СтрокаОшибки = СтрокаОшибки + Символы.ПС + "Укажите другую дату мероприятия!";

						ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки, , , , Отказ);	

					//-- #Б-2596 смарт: Лопато 10.03.2025
					Иначе
						
						Если Выборка.смартРезервироватьОборудование Тогда
						
							ОбщегоНазначения.СообщитьПользователю(СтрокаОшибки);
							
						КонецЕсли;
						
						Описание = "В связи с созданием более важной Заявки на маркетинговое мероприятие необходимо перенести дату Вашего мероприятия"
								   + Символы.ПС + СокрЛП(Выборка.Ссылка) + "." + Символы.ПС  
								   + "В ближайшее время она будет отменена Администратором демозала.";

						МассивОписанийДляНапоминаний.Добавить(Новый Структура("Менеджер, Описание", Выборка.Менеджер, Описание));
						
					КонецЕсли;	
					
				КонецЦикла;	
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	
	//-- #Б-1474 смарт: Фролов 05.12.2024
	
	ДополнительныеСвойства.Вставить("МассивОписанийДляНапоминаний", МассивОписанийДляНапоминаний);
	//-- #Б-1988 смарт: Лопато 21.02.2025
	
КонецПроцедуры

&Вместо("ПриЗаписи")
Процедура смарт_ПриЗаписи(Отказ)

	//++ смарт:ММ #011 154 13.12.2019
	смартЭтоНовый = Неопределено;
	
	Если ДополнительныеСвойства.Свойство("смартЭтоНовый", смартЭтоНовый) И НЕ Отказ Тогда
		
		Если смартЭтоНовый = Истина Тогда
			
			// Отправка уведомления о создании нового документа на почту
			АдресаДляОтправкиСтрокой = "";
			МассивАдресовДляОтправки = смартПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой);
						
			УчетнаяЗапись = РаботаСПочтовымиСообщениями.СистемнаяУчетнаяЗапись();
			
			//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
			//Если ЗначениеЗаполнено(УчетнаяЗапись) И МассивАдресовДляОтправки.Количество() > 0 Тогда
			
			ТестовыеАдресаСтрока = "";
			ТестовыеАдресаМассив = смартОбщегоНазначения.ПолучитьТестовыеАдресаДляРассылок(ТестовыеАдресаСтрока);
			
			ЭтоТестоваяБаза = НЕ смартОбщегоНазначения.смартРабочаяБаза();
			
			Если ЗначениеЗаполнено(УчетнаяЗапись)
				И (ТестовыеАдресаМассив.Количество() > 0
				ИЛИ (МассивАдресовДляОтправки.Количество() > 0 И НЕ ЭтоТестоваяБаза)) Тогда
			//-- смарт:ММ 03.03.2021
			
				ТемаПисьма = "Создан новый документ " + Ссылка;
				ТекстПисьма = "Создан новый документ " + Ссылка + " 
				|
				|Тип мероприятия: """ + Ссылка.ТипМероприятия + """"; 
				
				ДанныеОтправки = Новый Структура("Тема,Заголовок", ТемаПисьма, ТекстПисьма);
				
				//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
				//ПараметрыПисьма = ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки);
				ПараметрыПисьма = смартОбщегоНазначения.ПолучитьПараметрыОтправки(МассивАдресовДляОтправки, ДанныеОтправки,, ТестовыеАдресаМассив, ТестовыеАдресаСтрока, ЭтоТестоваяБаза);
				//-- смарт:ММ 04.03.2021
				
				Попытка
					ИдентификаторПисьма = РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(УчетнаяЗапись, ПараметрыПисьма);
					//++ смарт:ММ #098 464 04.03.2021 Доработка рассылок на тестовые адреса
					//ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, "Отправлено уведомление о создании документа " + Ссылка + Символы.ПС + " на почту: " + АдресаДляОтправкиСтрокой);
					Если ПараметрыПисьма.ТестоваяБаза Тогда
						ТекстСообщения = "Отправлено уведомление о создании документа " + Ссылка + Символы.ПС + " НА ТЕСТОВУЮ ПОЧТУ " +  ПараметрыПисьма.ТестовыеАдреса + " (в рабочей базе отправилось бы на почту " +  АдресаДляОтправкиСтрокой + ")";	
					Иначе				
						ТекстСообщения = "Отправлено уведомление о создании документа " + Ссылка + Символы.ПС + " на почту: " + АдресаДляОтправкиСтрокой;				
					КонецЕсли;
					
					ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Информация,,, ТекстСообщения);
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
					//-- смарт:ММ 03.03.2021

				Исключение
					//++ #1416 смарт: Фролов 30.08.2023 //Механизм формирования заявок на склад Адмирал Внуково и Адмирал Внуково КОВЧЕГ 
					смартОбщегоНазначения.смартЗафиксироватьНеОтправленноеПисьмо(ПараметрыПисьма,Ссылка,ТекстПисьма);
					//-- #1416 смарт: Фролов 30.08.2023
					ЗаписьЖурналаРегистрации("ОтправкаУведомления", УровеньЖурналаРегистрации.Ошибка,,, "Не удалось отправить уведомление о создании документа " + Ссылка + Символы.ПС + ОписаниеОшибки());
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;

	//ПродолжитьВызов(Отказ);
	//-- смарт:ММ 13.12.2019
	
КонецПроцедуры

#КонецОбласти
	
#КонецОбласти

#КонецЕсли

//++ смарт:ММ #011 154 13.12.2019
Функция смартПолучитьАдресаПолучателейУведомлений(АдресаДляОтправкиСтрокой)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартПредопределенныеЗначения.Значение КАК Пользователь
	|ПОМЕСТИТЬ ВТ_СписокПользователей
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения КАК смартПредопределенныеЗначения
	|ГДЕ
	|	смартПредопределенныеЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначения.СписокЗначений = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	смартПредопределенныеЗначенияЗначения.Значение
	|ИЗ
	|	Справочник.смартПредопределенныеЗначения.Значения КАК смартПредопределенныеЗначенияЗначения
	|ГДЕ
	|	смартПредопределенныеЗначенияЗначения.Ссылка = &Ссылка
	|	И смартПредопределенныеЗначенияЗначения.Ссылка.СписокЗначений = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	ПользователиСпр.смартРабочаяПочта КАК смартРабочаяПочта
	|ИЗ
	|	ВТ_СписокПользователей КАК ВТ_СписокПользователей
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК ПользователиСпр
	|		ПО ВТ_СписокПользователей.Пользователь = ПользователиСпр.Ссылка
	|ГДЕ 
	|	ЕСТЬNULL(ПользователиСпр.смартРабочаяПочта, """") <> """"";
	
	Запрос.УстановитьПараметр("Ссылка", Справочники.смартПредопределенныеЗначения.ПользовательДляУведомленийОСозданииМаркетинговогоМероприятия);
	
	МассивАдресов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		АдресаТекущегоПоля = ОбщегоНазначенияКлиентСервер.АдресаЭлектроннойПочтыИзСтроки(Выборка.смартРабочаяПочта);
		
		Для Каждого ЭлементСтруктуры Из АдресаТекущегоПоля Цикл
			МассивАдресов.Добавить(Новый Структура("Адрес,Представление", ЭлементСтруктуры.Адрес, ЭлементСтруктуры.Адрес));
			АдресаДляОтправкиСтрокой = АдресаДляОтправкиСтрокой + ?(ЗначениеЗаполнено(АдресаДляОтправкиСтрокой), ", ", "") + ЭлементСтруктуры.Адрес;
		КонецЦикла;
		
	КонецЦикла;
		
	Возврат МассивАдресов;
	
КонецФункции //-- смарт:ММ 13.12.2019

//++ смарт:ММ #011 154 13.12.2019
Функция ПолучитьФорматированныйТекст(ДанныеОтправки)
	
	Док = Новый ФорматированныйДокумент;
	
	Заголовок = Док.Добавить("Уведомление.", ТипЭлементаФорматированногоДокумента.Текст);
	Заголовок.Шрифт = Новый Шрифт("Arial", 16, Истина);
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	Абзац = Док.Добавить(ДанныеОтправки.Заголовок, ТипЭлементаФорматированногоДокумента.Текст);
	Абзац.Шрифт = Новый Шрифт("Arial", 12);
	
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	Док.Добавить("", ТипЭлементаФорматированногоДокумента.ПереводСтроки);
	
	Подпись = Док.Добавить("Письмо создано роботом и не требует ответа.", ТипЭлементаФорматированногоДокумента.Текст);
	Подпись.Шрифт = Новый Шрифт("Arial", 8);
	
	Возврат Док;
	
КонецФункции //-- смарт:ММ 13.12.2019

//++ #Б7900 смарт: Шляпников 24.08.2026 / Документ "Маркетинговое мероприятие". Форма списка документов. Отбор по полиграфическому оборудованию.
Функция смартДокументИмеетПолиграфическоеОборудование()
	
	ГруппаПолиграфии = смартОбщегоНазначенияСКэш.ПолучитьЗначениеПредопределеннойНастройки(
		"ГруппаПолиграфическогоОборудованияДемозала");
	
	Если Не ЗначениеЗаполнено(ГруппаПолиграфии) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОборудованиеДокумента = Новый Массив;
	Для Каждого СтрокаОборудования Из табОборудованиеДляДемонстрации Цикл
		
		Если ЗначениеЗаполнено(СтрокаОборудования.Оборудование) Тогда
			ОборудованиеДокумента.Добавить(СтрокаОборудования.Оборудование);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОборудованиеДокумента.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДемоОборудование.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.демоОборудованиеДляДемонстрации КАК ДемоОборудование
	|ГДЕ
	|	ДемоОборудование.Ссылка В (&Оборудование)
	|	И ДемоОборудование.Ссылка В ИЕРАРХИИ (&Группа)";
	
	Запрос.УстановитьПараметр("Оборудование", ОборудованиеДокумента);
	Запрос.УстановитьПараметр("Группа", ГруппаПолиграфии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции
